/** @type {import('tailwindcss').Config} */
module.exports = {
  // tailwindを適用したいファイル群を指定
  content: [
    "./app.vue", // <= ドキュメントからさらに追加
    //"./components/**/*.{vue,js}",
    //"./layouts/**/*.vue",
    //"./pages/**/*.vue",
    //"./plugins/**/*.{js,ts}",
  ],
  theme: {
    extend: {
    },
    colors: {
      primary: {
        50: "#f6f7f6",
        100: "#ebeeea",
        200: "#d5ddd5",
        300: "#a6b5a5",
        400: "#8d9d8b",
        500: "#6a7e69",
        600: "#556554",
        700: "#455144",
        800: "#394338",
        900: "#2f382f",
        950: "#171c17",
      },
      secondary: {
        50: "#fbf6ef",
        100: "#f4ebda",
        200: "#e4cda3",
        300: "#d6b173",
        400: "#cc9853",
        500: "#c27e3e",
        600: "#ab6334",
        700: "#8e4a2f",
        800: "#753c2b",
        900: "#613226",
        950: "#371811",
      },
      tertiary: {
        50: "#f7f7f6",
        100: "#e5e5e2",
        200: "#cacbc4",
        300: "#a7a99f",
        400: "#83867b",
        500: "#686b61",
        600: "#52554c",
        700: "#44463f",
        800: "#383a35",
        900: "#262724",
        950: "#1a1b18",
      },
    },
  },
  plugins: [],
};